In [1]:
import pandas as pd
import numpy as np

In [4]:
# Pandas Series 선언
fruit_price = pd.Series([3000, 5000, 9000, 6000, 10000],
                    index = ['Banana', 'Orange', 'Cherry', 'Mango', 'Melon'])
fruit_price

Banana     3000
Orange     5000
Cherry     9000
Mango      6000
Melon     10000
dtype: int64

In [5]:
cat_age = pd.Series([1, 2, 1.5, 3, 6],
                    index = ['나비', '뚱이', '야옹이', '치즈', '쿠마'])
cat_age

나비     1.0
뚱이     2.0
야옹이    1.5
치즈     3.0
쿠마     6.0
dtype: float64

In [19]:
# dict를 인수로 넣어서 pd.Series 선언 가능
# key가 pd.Series의 컬럼, value가 값으로 들어감
dog_weight = {'말티즈':3, '푸들':4, '리트리버':18, '슈나우저':10, '장모치와와':3}
dog_weight = pd.Series(dog_weight, name = 'weight')
print(dog_weight)

말티즈       3
푸들        4
리트리버     18
슈나우저     10
장모치와와     3
Name: weight, dtype: int64

In [7]:
avg_score = {'영어': 78, '수학':65, '국어':70, '사회':87, '과학': 50}
avg_score = pd.Series(avg_score)
print(avg_score)

영어    78
수학    65
국어    70
사회    87
과학    50
dtype: int64

In [8]:
df = pd.DataFrame([[1,5,3,2,5],[2,3,1,2,5]],
            index = ['1회차', '2회차'], columns = ['아이린', '슬기', '웬디', '조이', '예리'])
print('***볼링성적***')
df

***볼링성적***

     아이린  슬기  웬디  조이  예리
1회차    1   5   3   2   5
2회차    2   3   1   2   5

In [10]:
data = pd.DataFrame([[56, 53, 54, 52], [26.5, 24.7, 25.4, 23.3]],
                    index = ['체중 (kg)', '체지방 (%)'], columns = ['2019-03-01', '2019-04-01', '2019-05-01', '2019-06-01'])
data

         2019-03-01  2019-04-01  2019-05-01  2019-06-01
체중 (kg)        56.0        53.0        54.0        52.0
체지방 (%)        26.5        24.7        25.4        23.3

### pd.concat(pd.Series 또는 pd.DataFrame, axis = 1)
### Series와 DataFrame 들을 합쳐줌

In [13]:
s1 = pd.Series(np.random.randint(0,20,10), name = '볼링')
s2 = pd.Series(np.random.randint(0,20,10), name = '탁구')
pd.concat([s1,s2], axis = 1)

   볼링  탁구
0  18  11
1  12  19
2   5  12
3  18   9
4  15   9
5   5  17
6   7  19
7   7  11
8  16   6
9   0   0

In [29]:
dog_height = pd.Series({'말티즈':30, '푸들':32, '리트리버':58, '슈나우저':40, '장모치와와':23, '진돗개': 55}, name = 'height(cm)')
dog_df = pd.DataFrame(pd.concat([dog_height, dog_weight], axis = 1, sort = True))
dog_df

       height(cm)  weight
리트리버           58    18.0
말티즈            30     3.0
슈나우저           40    10.0
장모치와와          23     3.0
진돗개            55     NaN
푸들             32     4.0

In [28]:
cute = pd.Series({'말티즈':10, '푸들':8, '리트리버':6, '슈나우저':4, '장모치와와':9, '진돗개': 7}, name = 'cuteness')
pd.concat([dog_df, cute], axis = 1, sort = True)

       height(cm)  weight  cuteness
리트리버           58    18.0         6
말티즈            30     3.0        10
슈나우저           40    10.0         4
장모치와와          23     3.0         9
진돗개            55     NaN         7
푸들             32     4.0         8

### df.append(pd.Series) 는 행 추가

In [38]:
cols = pd.Series({'height(cm)':31, 'weight':4.3,'trainable':int(4), 'activeness':3, 'brush':5}, name = '요크셔테리어')
print(cols)
dog_df.append(cols)

height(cm)    31.0
weight         4.3
trainable      4.0
activeness     3.0
brush          5.0
Name: 요크셔테리어, dtype: float64

        height(cm)  weight  activeness  brush  trainable
리트리버          58.0    18.0         NaN    NaN        NaN
말티즈           30.0     3.0         NaN    NaN        NaN
슈나우저          40.0    10.0         NaN    NaN        NaN
장모치와와         23.0     3.0         NaN    NaN        NaN
진돗개           55.0     NaN         NaN    NaN        NaN
푸들            32.0     4.0         NaN    NaN        NaN
요크셔테리어        31.0     4.3         3.0    5.0        4.0